/**
 1. 说说类
 * 文字内容
 * 图片
 * 发表时间
 * 作者
 * 转发的说说
 * 评论数
 * 转发数
 * 点赞数
 
 2. 作者
 * 名称
 * 生日
 * 账号
 
 3. 账号
 * 账号名称
 * 账号密码
 * 账号注册时间
 
 模拟场景：
 * 张三在2007-9-8 17：56：34的时候， 注册了一个账号（名称：itcast， 密码：123456）
 * 张三的生日是1998-7-4 18：46：24
 * 张三在2010-8-8 9：23：44的时候， 发布一条说说
 * 文字内容  @“今天心情不错”
 * 图片 @“test.png”
 * 发表时间
 * 作者
 * 转发的说说
 * 评论数 100
 * 转发数 290
 * 点赞数 2000
 
 * 李四在2006-9-8 19：26：54的时候， 注册了一个账号（名称：lisiitcast， 密码：654321）
 * 李四的生日是1999-9-6 14：16：28
 * 李四在2011-8-8 20：47：09的时候， 转发了张三之前发布的说说， 并且还附带了一句话：@“今天心情确实不错”
 */
